Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/qspi.h
/* -------- QSPI_IER : (QSPI Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define QSPI_IER_RDRF_Pos                     _UINT32_(0)                                          /* (QSPI_IER) Receive Data Register Full Interrupt Enable Position */
#define QSPI_IER_RDRF_Msk                     (_UINT32_(0x1) << QSPI_IER_RDRF_Pos)                 /* (QSPI_IER) Receive Data Register Full Interrupt Enable Mask */
#define QSPI_IER_RDRF(value)                  (QSPI_IER_RDRF_Msk & (_UINT32_(value) << QSPI_IER_RDRF_Pos)) /* Assigment of value for RDRF in the QSPI_IER register */
#define QSPI_IER_TDRE_Pos                     _UINT32_(1)                                          /* (QSPI_IER) Transmit Data Register Empty Interrupt Enable Position */
#define QSPI_IER_TDRE_Msk                     (_UINT32_(0x1) << QSPI_IER_TDRE_Pos)                 /* (QSPI_IER) Transmit Data Register Empty Interrupt Enable Mask */
#define QSPI_IER_TDRE(value)                  (QSPI_IER_TDRE_Msk & (_UINT32_(value) << QSPI_IER_TDRE_Pos)) /* Assigment of value for TDRE in the QSPI_IER register */
#define QSPI_IER_TXEMPTY_Pos                  _UINT32_(2)                                          /* (QSPI_IER) Transmission Registers Empty Enable Position */
#define QSPI_IER_TXEMPTY_Msk                  (_UINT32_(0x1) << QSPI_IER_TXEMPTY_Pos)              /* (QSPI_IER) Transmission Registers Empty Enable Mask */
#define QSPI_IER_TXEMPTY(value)               (QSPI_IER_TXEMPTY_Msk & (_UINT32_(value) << QSPI_IER_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the QSPI_IER register */
#define QSPI_IER_OVRES_Pos                    _UINT32_(3)                                          /* (QSPI_IER) Overrun Error Interrupt Enable Position */
#define QSPI_IER_OVRES_Msk                    (_UINT32_(0x1) << QSPI_IER_OVRES_Pos)                /* (QSPI_IER) Overrun Error Interrupt Enable Mask */
#define QSPI_IER_OVRES(value)                 (QSPI_IER_OVRES_Msk & (_UINT32_(value) << QSPI_IER_OVRES_Pos)) /* Assigment of value for OVRES in the QSPI_IER register */
#define QSPI_IER_ENDRX_Pos                    _UINT32_(4)                                          /* (QSPI_IER) End of Receive Buffer Interrupt Enable Position */
#define QSPI_IER_ENDRX_Msk                    (_UINT32_(0x1) << QSPI_IER_ENDRX_Pos)                /* (QSPI_IER) End of Receive Buffer Interrupt Enable Mask */
#define QSPI_IER_ENDRX(value)                 (QSPI_IER_ENDRX_Msk & (_UINT32_(value) << QSPI_IER_ENDRX_Pos)) /* Assigment of value for ENDRX in the QSPI_IER register */
#define QSPI_IER_ENDTX_Pos                    _UINT32_(5)                                          /* (QSPI_IER) End of Transmit Buffer Interrupt Enable Position */
#define QSPI_IER_ENDTX_Msk                    (_UINT32_(0x1) << QSPI_IER_ENDTX_Pos)                /* (QSPI_IER) End of Transmit Buffer Interrupt Enable Mask */
#define QSPI_IER_ENDTX(value)                 (QSPI_IER_ENDTX_Msk & (_UINT32_(value) << QSPI_IER_ENDTX_Pos)) /* Assigment of value for ENDTX in the QSPI_IER register */
#define QSPI_IER_RXBUFF_Pos                   _UINT32_(6)                                          /* (QSPI_IER) Receive Buffer Full Interrupt Enable Position */
#define QSPI_IER_RXBUFF_Msk                   (_UINT32_(0x1) << QSPI_IER_RXBUFF_Pos)               /* (QSPI_IER) Receive Buffer Full Interrupt Enable Mask */
#define QSPI_IER_RXBUFF(value)                (QSPI_IER_RXBUFF_Msk & (_UINT32_(value) << QSPI_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the QSPI_IER register */
#define QSPI_IER_TXBUFE_Pos                   _UINT32_(7)                                          /* (QSPI_IER) Transmit Buffer Empty Interrupt Enable Position */
#define QSPI_IER_TXBUFE_Msk                   (_UINT32_(0x1) << QSPI_IER_TXBUFE_Pos)               /* (QSPI_IER) Transmit Buffer Empty Interrupt Enable Mask */
#define QSPI_IER_TXBUFE(value)                (QSPI_IER_TXBUFE_Msk & (_UINT32_(value) << QSPI_IER_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the QSPI_IER register */
#define QSPI_IER_CSR_Pos                      _UINT32_(8)                                          /* (QSPI_IER) Chip Select Rise Interrupt Enable Position */
#define QSPI_IER_CSR_Msk                      (_UINT32_(0x1) << QSPI_IER_CSR_Pos)                  /* (QSPI_IER) Chip Select Rise Interrupt Enable Mask */
#define QSPI_IER_CSR(value)                   (QSPI_IER_CSR_Msk & (_UINT32_(value) << QSPI_IER_CSR_Pos)) /* Assigment of value for CSR in the QSPI_IER register */
#define QSPI_IER_INSTRE_Pos                   _UINT32_(10)                                         /* (QSPI_IER) Instruction End Interrupt Enable Position */
#define QSPI_IER_INSTRE_Msk                   (_UINT32_(0x1) << QSPI_IER_INSTRE_Pos)               /* (QSPI_IER) Instruction End Interrupt Enable Mask */
#define QSPI_IER_INSTRE(value)                (QSPI_IER_INSTRE_Msk & (_UINT32_(value) << QSPI_IER_INSTRE_Pos)) /* Assigment of value for INSTRE in the QSPI_IER register */
#define QSPI_IER_LWRA_Pos                     _UINT32_(11)                                         /* (QSPI_IER) Last Write Access Interrupt Enable Position */
#define QSPI_IER_LWRA_Msk                     (_UINT32_(0x1) << QSPI_IER_LWRA_Pos)                 /* (QSPI_IER) Last Write Access Interrupt Enable Mask */
#define QSPI_IER_LWRA(value)                  (QSPI_IER_LWRA_Msk & (_UINT32_(value) << QSPI_IER_LWRA_Pos)) /* Assigment of value for LWRA in the QSPI_IER register */
#define QSPI_IER_QITF_Pos                     _UINT32_(12)                                         /* (QSPI_IER) QSPI Interrupt Fall Interrupt Enable Position */
#define QSPI_IER_QITF_Msk                     (_UINT32_(0x1) << QSPI_IER_QITF_Pos)                 /* (QSPI_IER) QSPI Interrupt Fall Interrupt Enable Mask */
#define QSPI_IER_QITF(value)                  (QSPI_IER_QITF_Msk & (_UINT32_(value) << QSPI_IER_QITF_Pos)) /* Assigment of value for QITF in the QSPI_IER register */
#define QSPI_IER_QITR_Pos                     _UINT32_(13)                                         /* (QSPI_IER) QSPI Interrupt Rise Interrupt Enable Position */
#define QSPI_IER_QITR_Msk                     (_UINT32_(0x1) << QSPI_IER_QITR_Pos)                 /* (QSPI_IER) QSPI Interrupt Rise Interrupt Enable Mask */
#define QSPI_IER_QITR(value)                  (QSPI_IER_QITR_Msk & (_UINT32_(value) << QSPI_IER_QITR_Pos)) /* Assigment of value for QITR in the QSPI_IER register */
#define QSPI_IER_CSFA_Pos                     _UINT32_(14)                                         /* (QSPI_IER) Chip Select Fall Autoclear Interrupt Enable Position */
#define QSPI_IER_CSFA_Msk                     (_UINT32_(0x1) << QSPI_IER_CSFA_Pos)                 /* (QSPI_IER) Chip Select Fall Autoclear Interrupt Enable Mask */
#define QSPI_IER_CSFA(value)                  (QSPI_IER_CSFA_Msk & (_UINT32_(value) << QSPI_IER_CSFA_Pos)) /* Assigment of value for CSFA in the QSPI_IER register */
#define QSPI_IER_CSRA_Pos                     _UINT32_(15)                                         /* (QSPI_IER) Chip Select Rise Autoclear Interrupt Enable Position */
#define QSPI_IER_CSRA_Msk                     (_UINT32_(0x1) << QSPI_IER_CSRA_Pos)                 /* (QSPI_IER) Chip Select Rise Autoclear Interrupt Enable Mask */
#define QSPI_IER_CSRA(value)                  (QSPI_IER_CSRA_Msk & (_UINT32_(value) << QSPI_IER_CSRA_Pos)) /* Assigment of value for CSRA in the QSPI_IER register */
#define QSPI_IER_TOUT_Pos                     _UINT32_(17)                                         /* (QSPI_IER) QSPI Time-out Interrupt Enable Position */
#define QSPI_IER_TOUT_Msk                     (_UINT32_(0x1) << QSPI_IER_TOUT_Pos)                 /* (QSPI_IER) QSPI Time-out Interrupt Enable Mask */
#define QSPI_IER_TOUT(value)                  (QSPI_IER_TOUT_Msk & (_UINT32_(value) << QSPI_IER_TOUT_Pos)) /* Assigment of value for TOUT in the QSPI_IER register */
#define QSPI_IER_Msk                          _UINT32_(0x0002FDFF)                                 /* (QSPI_IER) Register Mask  */


/* -------- QSPI_IDR : (QSPI Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define QSPI_IDR_RDRF_Pos                     _UINT32_(0)                                          /* (QSPI_IDR) Receive Data Register Full Interrupt Disable Position */
#define QSPI_IDR_RDRF_Msk                     (_UINT32_(0x1) << QSPI_IDR_RDRF_Pos)                 /* (QSPI_IDR) Receive Data Register Full Interrupt Disable Mask */
#define QSPI_IDR_RDRF(value)                  (QSPI_IDR_RDRF_Msk & (_UINT32_(value) << QSPI_IDR_RDRF_Pos)) /* Assigment of value for RDRF in the QSPI_IDR register */
#define QSPI_IDR_TDRE_Pos                     _UINT32_(1)                                          /* (QSPI_IDR) Transmit Data Register Empty Interrupt Disable Position */
#define QSPI_IDR_TDRE_Msk                     (_UINT32_(0x1) << QSPI_IDR_TDRE_Pos)                 /* (QSPI_IDR) Transmit Data Register Empty Interrupt Disable Mask */
#define QSPI_IDR_TDRE(value)                  (QSPI_IDR_TDRE_Msk & (_UINT32_(value) << QSPI_IDR_TDRE_Pos)) /* Assigment of value for TDRE in the QSPI_IDR register */
#define QSPI_IDR_TXEMPTY_Pos                  _UINT32_(2)                                          /* (QSPI_IDR) Transmission Registers Empty Disable Position */
#define QSPI_IDR_TXEMPTY_Msk                  (_UINT32_(0x1) << QSPI_IDR_TXEMPTY_Pos)              /* (QSPI_IDR) Transmission Registers Empty Disable Mask */
#define QSPI_IDR_TXEMPTY(value)               (QSPI_IDR_TXEMPTY_Msk & (_UINT32_(value) << QSPI_IDR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the QSPI_IDR register */
#define QSPI_IDR_OVRES_Pos                    _UINT32_(3)                                          /* (QSPI_IDR) Overrun Error Interrupt Disable Position */
#define QSPI_IDR_OVRES_Msk                    (_UINT32_(0x1) << QSPI_IDR_OVRES_Pos)                /* (QSPI_IDR) Overrun Error Interrupt Disable Mask */
#define QSPI_IDR_OVRES(value)                 (QSPI_IDR_OVRES_Msk & (_UINT32_(value) << QSPI_IDR_OVRES_Pos)) /* Assigment of value for OVRES in the QSPI_IDR register */
#define QSPI_IDR_ENDRX_Pos                    _UINT32_(4)                                          /* (QSPI_IDR) End of Receive Buffer Interrupt Disable Position */
#define QSPI_IDR_ENDRX_Msk                    (_UINT32_(0x1) << QSPI_IDR_ENDRX_Pos)                /* (QSPI_IDR) End of Receive Buffer Interrupt Disable Mask */
#define QSPI_IDR_ENDRX(value)                 (QSPI_IDR_ENDRX_Msk & (_UINT32_(value) << QSPI_IDR_ENDRX_Pos)) /* Assigment of value for ENDRX in the QSPI_IDR register */
#define QSPI_IDR_ENDTX_Pos                    _UINT32_(5)                                          /* (QSPI_IDR) End of Transmit Buffer Interrupt Disable Position */
#define QSPI_IDR_ENDTX_Msk                    (_UINT32_(0x1) << QSPI_IDR_ENDTX_Pos)                /* (QSPI_IDR) End of Transmit Buffer Interrupt Disable Mask */
#define QSPI_IDR_ENDTX(value)                 (QSPI_IDR_ENDTX_Msk & (_UINT32_(value) << QSPI_IDR_ENDTX_Pos)) /* Assigment of value for ENDTX in the QSPI_IDR register */
#define QSPI_IDR_RXBUFF_Pos                   _UINT32_(6)                                          /* (QSPI_IDR) Receive Buffer Full Interrupt Disable Position */
#define QSPI_IDR_RXBUFF_Msk                   (_UINT32_(0x1) << QSPI_IDR_RXBUFF_Pos)               /* (QSPI_IDR) Receive Buffer Full Interrupt Disable Mask */
#define QSPI_IDR_RXBUFF(value)                (QSPI_IDR_RXBUFF_Msk & (_UINT32_(value) << QSPI_IDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the QSPI_IDR register */
#define QSPI_IDR_TXBUFE_Pos                   _UINT32_(7)                                          /* (QSPI_IDR) Transmit Buffer Empty Interrupt Disable Position */
#define QSPI_IDR_TXBUFE_Msk                   (_UINT32_(0x1) << QSPI_IDR_TXBUFE_Pos)               /* (QSPI_IDR) Transmit Buffer Empty Interrupt Disable Mask */
#define QSPI_IDR_TXBUFE(value)                (QSPI_IDR_TXBUFE_Msk & (_UINT32_(value) << QSPI_IDR_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the QSPI_IDR register */
#define QSPI_IDR_CSR_Pos                      _UINT32_(8)                                          /* (QSPI_IDR) Chip Select Rise Interrupt Disable Position */
#define QSPI_IDR_CSR_Msk                      (_UINT32_(0x1) << QSPI_IDR_CSR_Pos)                  /* (QSPI_IDR) Chip Select Rise Interrupt Disable Mask */
#define QSPI_IDR_CSR(value)                   (QSPI_IDR_CSR_Msk & (_UINT32_(value) << QSPI_IDR_CSR_Pos)) /* Assigment of value for CSR in the QSPI_IDR register */
#define QSPI_IDR_INSTRE_Pos                   _UINT32_(10)                                         /* (QSPI_IDR) Instruction End Interrupt Disable Position */
#define QSPI_IDR_INSTRE_Msk                   (_UINT32_(0x1) << QSPI_IDR_INSTRE_Pos)               /* (QSPI_IDR) Instruction End Interrupt Disable Mask */
#define QSPI_IDR_INSTRE(value)                (QSPI_IDR_INSTRE_Msk & (_UINT32_(value) << QSPI_IDR_INSTRE_Pos)) /* Assigment of value for INSTRE in the QSPI_IDR register */
#define QSPI_IDR_LWRA_Pos                     _UINT32_(11)                                         /* (QSPI_IDR) Last Write Access Interrupt Disable Position */
#define QSPI_IDR_LWRA_Msk                     (_UINT32_(0x1) << QSPI_IDR_LWRA_Pos)                 /* (QSPI_IDR) Last Write Access Interrupt Disable Mask */
#define QSPI_IDR_LWRA(value)                  (QSPI_IDR_LWRA_Msk & (_UINT32_(value) << QSPI_IDR_LWRA_Pos)) /* Assigment of value for LWRA in the QSPI_IDR register */
#define QSPI_IDR_QITF_Pos                     _UINT32_(12)                                         /* (QSPI_IDR) QSPI Interrupt Fall Interrupt Disable Position */
#define QSPI_IDR_QITF_Msk                     (_UINT32_(0x1) << QSPI_IDR_QITF_Pos)                 /* (QSPI_IDR) QSPI Interrupt Fall Interrupt Disable Mask */
#define QSPI_IDR_QITF(value)                  (QSPI_IDR_QITF_Msk & (_UINT32_(value) << QSPI_IDR_QITF_Pos)) /* Assigment of value for QITF in the QSPI_IDR register */
#define QSPI_IDR_QITR_Pos                     _UINT32_(13)                                         /* (QSPI_IDR) QSPI Interrupt Rise Interrupt Disable Position */
#define QSPI_IDR_QITR_Msk                     (_UINT32_(0x1) << QSPI_IDR_QITR_Pos)                 /* (QSPI_IDR) QSPI Interrupt Rise Interrupt Disable Mask */
#define QSPI_IDR_QITR(value)                  (QSPI_IDR_QITR_Msk & (_UINT32_(value) << QSPI_IDR_QITR_Pos)) /* Assigment of value for QITR in the QSPI_IDR register */
#define QSPI_IDR_CSFA_Pos                     _UINT32_(14)                                         /* (QSPI_IDR) Chip Select Fall Autoclear Interrupt Disable Position */
#define QSPI_IDR_CSFA_Msk                     (_UINT32_(0x1) << QSPI_IDR_CSFA_Pos)                 /* (QSPI_IDR) Chip Select Fall Autoclear Interrupt Disable Mask */
#define QSPI_IDR_CSFA(value)                  (QSPI_IDR_CSFA_Msk & (_UINT32_(value) << QSPI_IDR_CSFA_Pos)) /* Assigment of value for CSFA in the QSPI_IDR register */
#define QSPI_IDR_CSRA_Pos                     _UINT32_(15)                                         /* (QSPI_IDR) Chip Select Rise Autoclear Interrupt Disable Position */
#define QSPI_IDR_CSRA_Msk                     (_UINT32_(0x1) << QSPI_IDR_CSRA_Pos)                 /* (QSPI_IDR) Chip Select Rise Autoclear Interrupt Disable Mask */
#define QSPI_IDR_CSRA(value)                  (QSPI_IDR_CSRA_Msk & (_UINT32_(value) << QSPI_IDR_CSRA_Pos)) /* Assigment of value for CSRA in the QSPI_IDR register */
#define QSPI_IDR_TOUT_Pos                     _UINT32_(17)                                         /* (QSPI_IDR) QSPI Time-out Interrupt Disable Position */
#define QSPI_IDR_TOUT_Msk                     (_UINT32_(0x1) << QSPI_IDR_TOUT_Pos)                 /* (QSPI_IDR) QSPI Time-out Interrupt Disable Mask */
#define QSPI_IDR_TOUT(value)                  (QSPI_IDR_TOUT_Msk & (_UINT32_(value) << QSPI_IDR_TOUT_Pos)) /* Assigment of value for TOUT in the QSPI_IDR register */
#define QSPI_IDR_Msk                          _UINT32_(0x0002FDFF)                                 /* (QSPI_IDR) Register Mask  */


