Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/qspi.h
/* -------- QSPI_PTSR : (QSPI Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define QSPI_PTSR_RXTEN_Pos                   _UINT32_(0)                                          /* (QSPI_PTSR) Receiver Transfer Enable Position */
#define QSPI_PTSR_RXTEN_Msk                   (_UINT32_(0x1) << QSPI_PTSR_RXTEN_Pos)               /* (QSPI_PTSR) Receiver Transfer Enable Mask */
#define QSPI_PTSR_RXTEN(value)                (QSPI_PTSR_RXTEN_Msk & (_UINT32_(value) << QSPI_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the QSPI_PTSR register */
#define QSPI_PTSR_TXTEN_Pos                   _UINT32_(8)                                          /* (QSPI_PTSR) Transmitter Transfer Enable Position */
#define QSPI_PTSR_TXTEN_Msk                   (_UINT32_(0x1) << QSPI_PTSR_TXTEN_Pos)               /* (QSPI_PTSR) Transmitter Transfer Enable Mask */
#define QSPI_PTSR_TXTEN(value)                (QSPI_PTSR_TXTEN_Msk & (_UINT32_(value) << QSPI_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the QSPI_PTSR register */
#define QSPI_PTSR_RXCBEN_Pos                  _UINT32_(16)                                         /* (QSPI_PTSR) Receiver Circular Buffer Enable Position */
#define QSPI_PTSR_RXCBEN_Msk                  (_UINT32_(0x1) << QSPI_PTSR_RXCBEN_Pos)              /* (QSPI_PTSR) Receiver Circular Buffer Enable Mask */
#define QSPI_PTSR_RXCBEN(value)               (QSPI_PTSR_RXCBEN_Msk & (_UINT32_(value) << QSPI_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the QSPI_PTSR register */
#define QSPI_PTSR_TXCBEN_Pos                  _UINT32_(18)                                         /* (QSPI_PTSR) Transmitter Circular Buffer Enable Position */
#define QSPI_PTSR_TXCBEN_Msk                  (_UINT32_(0x1) << QSPI_PTSR_TXCBEN_Pos)              /* (QSPI_PTSR) Transmitter Circular Buffer Enable Mask */
#define QSPI_PTSR_TXCBEN(value)               (QSPI_PTSR_TXCBEN_Msk & (_UINT32_(value) << QSPI_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the QSPI_PTSR register */
#define QSPI_PTSR_ERR_Pos                     _UINT32_(24)                                         /* (QSPI_PTSR) Transfer Bus Error Position */
#define QSPI_PTSR_ERR_Msk                     (_UINT32_(0x1) << QSPI_PTSR_ERR_Pos)                 /* (QSPI_PTSR) Transfer Bus Error Mask */
#define QSPI_PTSR_ERR(value)                  (QSPI_PTSR_ERR_Msk & (_UINT32_(value) << QSPI_PTSR_ERR_Pos)) /* Assigment of value for ERR in the QSPI_PTSR register */
#define QSPI_PTSR_Msk                         _UINT32_(0x01050101)                                 /* (QSPI_PTSR) Register Mask  */


/* -------- QSPI_PWPMR : (QSPI Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define QSPI_PWPMR_WPPTREN_Pos                _UINT32_(0)                                          /* (QSPI_PWPMR) Write Protection Pointer Registers Enable Position */
#define QSPI_PWPMR_WPPTREN_Msk                (_UINT32_(0x1) << QSPI_PWPMR_WPPTREN_Pos)            /* (QSPI_PWPMR) Write Protection Pointer Registers Enable Mask */
#define QSPI_PWPMR_WPPTREN(value)             (QSPI_PWPMR_WPPTREN_Msk & (_UINT32_(value) << QSPI_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the QSPI_PWPMR register */
#define QSPI_PWPMR_WPCTREN_Pos                _UINT32_(1)                                          /* (QSPI_PWPMR) Write Protection Counter Registers Enable Position */
#define QSPI_PWPMR_WPCTREN_Msk                (_UINT32_(0x1) << QSPI_PWPMR_WPCTREN_Pos)            /* (QSPI_PWPMR) Write Protection Counter Registers Enable Mask */
#define QSPI_PWPMR_WPCTREN(value)             (QSPI_PWPMR_WPCTREN_Msk & (_UINT32_(value) << QSPI_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the QSPI_PWPMR register */
#define QSPI_PWPMR_WPCREN_Pos                 _UINT32_(2)                                          /* (QSPI_PWPMR) Write Protection Control Register Enable Position */
#define QSPI_PWPMR_WPCREN_Msk                 (_UINT32_(0x1) << QSPI_PWPMR_WPCREN_Pos)             /* (QSPI_PWPMR) Write Protection Control Register Enable Mask */
#define QSPI_PWPMR_WPCREN(value)              (QSPI_PWPMR_WPCREN_Msk & (_UINT32_(value) << QSPI_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the QSPI_PWPMR register */
#define QSPI_PWPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (QSPI_PWPMR) Write Protection Key Position */
#define QSPI_PWPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << QSPI_PWPMR_WPKEY_Pos)         /* (QSPI_PWPMR) Write Protection Key Mask */
#define QSPI_PWPMR_WPKEY(value)               (QSPI_PWPMR_WPKEY_Msk & (_UINT32_(value) << QSPI_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the QSPI_PWPMR register */
#define   QSPI_PWPMR_WPKEY_PASSWD_Val         _UINT32_(0x504443)                                   /* (QSPI_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define QSPI_PWPMR_WPKEY_PASSWD               (QSPI_PWPMR_WPKEY_PASSWD_Val << QSPI_PWPMR_WPKEY_Pos) /* (QSPI_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define QSPI_PWPMR_Msk                        _UINT32_(0xFFFFFF07)                                 /* (QSPI_PWPMR) Register Mask  */


/** \brief QSPI register offsets definitions */
#define QSPI_CR_REG_OFST               _UINT32_(0x00)      /* (QSPI_CR) Control Register Offset */
#define QSPI_MR_REG_OFST               _UINT32_(0x04)      /* (QSPI_MR) Mode Register Offset */
#define QSPI_RDR_REG_OFST              _UINT32_(0x08)      /* (QSPI_RDR) Receive Data Register Offset */
#define QSPI_TDR_REG_OFST              _UINT32_(0x0C)      /* (QSPI_TDR) Transmit Data Register Offset */
#define QSPI_ISR_REG_OFST              _UINT32_(0x10)      /* (QSPI_ISR) Interrupt Status Register Offset */
#define QSPI_IER_REG_OFST              _UINT32_(0x14)      /* (QSPI_IER) Interrupt Enable Register Offset */
#define QSPI_IDR_REG_OFST              _UINT32_(0x18)      /* (QSPI_IDR) Interrupt Disable Register Offset */
#define QSPI_IMR_REG_OFST              _UINT32_(0x1C)      /* (QSPI_IMR) Interrupt Mask Register Offset */
#define QSPI_SCR_REG_OFST              _UINT32_(0x20)      /* (QSPI_SCR) Serial Clock Register Offset */
#define QSPI_SR_REG_OFST               _UINT32_(0x24)      /* (QSPI_SR) Status Register Offset */
#define QSPI_IAR_REG_OFST              _UINT32_(0x30)      /* (QSPI_IAR) Instruction Address Register Offset */
#define QSPI_WICR_REG_OFST             _UINT32_(0x34)      /* (QSPI_WICR) Write Instruction Code Register Offset */
#define QSPI_IFR_REG_OFST              _UINT32_(0x38)      /* (QSPI_IFR) Instruction Frame Register Offset */
#define QSPI_RICR_REG_OFST             _UINT32_(0x3C)      /* (QSPI_RICR) Read Instruction Code Register Offset */
#define QSPI_SMR_REG_OFST              _UINT32_(0x40)      /* (QSPI_SMR) Scrambling Mode Register Offset */
#define QSPI_SKR_REG_OFST              _UINT32_(0x44)      /* (QSPI_SKR) Scrambling Key Register Offset */
#define QSPI_WRACNT_REG_OFST           _UINT32_(0x54)      /* (QSPI_WRACNT) Write Access Counter Register Offset */
#define QSPI_TOUT_REG_OFST             _UINT32_(0x64)      /* (QSPI_TOUT) Timeout Register Offset */
#define QSPI_WPMR_REG_OFST             _UINT32_(0xE4)      /* (QSPI_WPMR) Write Protection Mode Register Offset */
#define QSPI_WPSR_REG_OFST             _UINT32_(0xE8)      /* (QSPI_WPSR) Write Protection Status Register Offset */
#define QSPI_RPR_REG_OFST              _UINT32_(0x100)     /* (QSPI_RPR) Receive Pointer Register Offset */
#define QSPI_RCR_REG_OFST              _UINT32_(0x104)     /* (QSPI_RCR) Receive Counter Register Offset */
#define QSPI_TPR_REG_OFST              _UINT32_(0x108)     /* (QSPI_TPR) Transmit Pointer Register Offset */
#define QSPI_TCR_REG_OFST              _UINT32_(0x10C)     /* (QSPI_TCR) Transmit Counter Register Offset */
#define QSPI_RNPR_REG_OFST             _UINT32_(0x110)     /* (QSPI_RNPR) Receive Next Pointer Register Offset */
#define QSPI_RNCR_REG_OFST             _UINT32_(0x114)     /* (QSPI_RNCR) Receive Next Counter Register Offset */
#define QSPI_TNPR_REG_OFST             _UINT32_(0x118)     /* (QSPI_TNPR) Transmit Next Pointer Register Offset */
#define QSPI_TNCR_REG_OFST             _UINT32_(0x11C)     /* (QSPI_TNCR) Transmit Next Counter Register Offset */
#define QSPI_PTCR_REG_OFST             _UINT32_(0x120)     /* (QSPI_PTCR) Transfer Control Register Offset */
#define QSPI_PTSR_REG_OFST             _UINT32_(0x124)     /* (QSPI_PTSR) Transfer Status Register Offset */
#define QSPI_PWPMR_REG_OFST            _UINT32_(0x128)     /* (QSPI_PWPMR) Write Protection Mode Register Offset */

